zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32g0xx/drivers/include/stm32g0xx_hal_dma.h
  uint32_t                         DMAmuxChannelStatusMask;           /*!< DMAMUX Channel Status Mask            */

  DMAMUX_RequestGen_TypeDef        *DMAmuxRequestGen;                 /*!< DMAMUX request generator Base Address */

  DMAMUX_RequestGenStatus_TypeDef  *DMAmuxRequestGenStatus;           /*!< DMAMUX request generator Address      */

  uint32_t                         DMAmuxRequestGenStatusMask;        /*!< DMAMUX request generator Status mask  */
} DMA_HandleTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_Error_Code DMA Error Code
  * @{
  */
#define HAL_DMA_ERROR_NONE           0x00000000U       /*!< No error                                */
#define HAL_DMA_ERROR_TE             0x00000001U       /*!< Transfer error                          */
#define HAL_DMA_ERROR_NO_XFER        0x00000004U       /*!< Abort requested with no Xfer ongoing    */
#define HAL_DMA_ERROR_TIMEOUT        0x00000020U       /*!< Timeout error                           */
#define HAL_DMA_ERROR_NOT_SUPPORTED  0x00000100U       /*!< Not supported mode                      */
#define HAL_DMA_ERROR_SYNC           0x00000200U       /*!< DMAMUX sync overrun  error              */
#define HAL_DMA_ERROR_REQGEN         0x00000400U       /*!< DMAMUX request generator overrun  error */

/**
  * @}
  */

/** @defgroup DMA_request DMA request
  * @{
  */
#define DMA_REQUEST_MEM2MEM           0U               /*!< memory to memory transfer     */


#define DMA_REQUEST_GENERATOR0        1U               /*!< DMAMUX request generator 0    */
#define DMA_REQUEST_GENERATOR1        2U               /*!< DMAMUX request generator 1    */
#define DMA_REQUEST_GENERATOR2        3U               /*!< DMAMUX request generator 2    */
#define DMA_REQUEST_GENERATOR3        4U               /*!< DMAMUX request generator 3    */


#define DMA_REQUEST_ADC1              5U               /*!< DMAMUX ADC1 request           */

#if defined(AES)
#define DMA_REQUEST_AES_IN            6U               /*!< DMAMUX AES IN request         */
#define DMA_REQUEST_AES_OUT           7U               /*!< DMAMUX AES OUT request        */
#endif

#if defined(DAC1)
#define DMA_REQUEST_DAC1_CHANNEL1     8U               /*!< DMAMUX SPI2 RX request        */
#define DMA_REQUEST_DAC1_CHANNEL2     9U               /*!< DMAMUX SPI2 TX request        */
#endif

#define DMA_REQUEST_I2C1_RX          10U               /*!< DMAMUX I2C1 RX request        */
#define DMA_REQUEST_I2C1_TX          11U               /*!< DMAMUX I2C1 TX request        */
#define DMA_REQUEST_I2C2_RX          12U               /*!< DMAMUX I2C2 RX request        */
#define DMA_REQUEST_I2C2_TX          13U               /*!< DMAMUX I2C2 TX request        */

#if defined(LPUART1)
#define DMA_REQUEST_LPUART1_RX       14U               /*!< DMAMUX LPUART1 RX request     */
#define DMA_REQUEST_LPUART1_TX       15U               /*!< DMAMUX LPUART1 TX request     */
#endif

#define DMA_REQUEST_SPI1_RX          16U               /*!< DMAMUX SPI1 RX request        */
#define DMA_REQUEST_SPI1_TX          17U               /*!< DMAMUX SPI1 TX request        */
#define DMA_REQUEST_SPI2_RX          18U               /*!< DMAMUX SPI2 RX request        */
#define DMA_REQUEST_SPI2_TX          19U               /*!< DMAMUX SPI2 TX request        */


#define DMA_REQUEST_TIM1_CH1         20U               /*!< DMAMUX TIM1 CH1 request       */
#define DMA_REQUEST_TIM1_CH2         21U               /*!< DMAMUX TIM1 CH2 request       */
#define DMA_REQUEST_TIM1_CH3         22U               /*!< DMAMUX TIM1 CH3 request       */
#define DMA_REQUEST_TIM1_CH4         23U               /*!< DMAMUX TIM1 CH4 request       */
#define DMA_REQUEST_TIM1_TRIG_COM    24U               /*!< DMAMUX TIM1 TRIG COM request  */
#define DMA_REQUEST_TIM1_UP          25U               /*!< DMAMUX TIM1 UP request        */

#if defined(TIM2)
#define DMA_REQUEST_TIM2_CH1         26U               /*!< DMAMUX TIM2 CH1 request       */
#define DMA_REQUEST_TIM2_CH2         27U               /*!< DMAMUX TIM2 CH2 request       */
#define DMA_REQUEST_TIM2_CH3         28U               /*!< DMAMUX TIM2 CH3 request       */
#define DMA_REQUEST_TIM2_CH4         29U               /*!< DMAMUX TIM2 CH4 request       */
#define DMA_REQUEST_TIM2_TRIG        30U               /*!< DMAMUX TIM2 TRIG request      */
#define DMA_REQUEST_TIM2_UP          31U               /*!< DMAMUX TIM2 UP request        */
#endif

#define DMA_REQUEST_TIM3_CH1         32U               /*!< DMAMUX TIM3 CH1 request       */
#define DMA_REQUEST_TIM3_CH2         33U               /*!< DMAMUX TIM3 CH2 request       */
#define DMA_REQUEST_TIM3_CH3         34U               /*!< DMAMUX TIM3 CH3 request       */
#define DMA_REQUEST_TIM3_CH4         35U               /*!< DMAMUX TIM3 CH4 request       */
#define DMA_REQUEST_TIM3_TRIG        36U               /*!< DMAMUX TIM3 TRIG request      */
#define DMA_REQUEST_TIM3_UP          37U               /*!< DMAMUX TIM3 UP request        */

#if defined(TIM6)
#define DMA_REQUEST_TIM6_UP          38U               /*!< DMAMUX TIM6 UP request        */
#endif
#if defined(TIM7)
#define DMA_REQUEST_TIM7_UP          39U               /*!< DMAMUX TIM7 UP request        */
#endif

#if defined(TIM15)
#define DMA_REQUEST_TIM15_CH1        40U               /*!< DMAMUX TIM15 CH1 request      */
#define DMA_REQUEST_TIM15_CH2        41U               /*!< DMAMUX TIM15 CH2 request      */
#define DMA_REQUEST_TIM15_TRIG_COM   42U               /*!< DMAMUX TIM15 TRIG COM request */
#define DMA_REQUEST_TIM15_UP         43U               /*!< DMAMUX TIM15 UP request       */
#endif

#define DMA_REQUEST_TIM16_CH1        44U               /*!< DMAMUX TIM16 CH1 request      */
#define DMA_REQUEST_TIM16_TRIG_COM   45U               /*!< DMAMUX TIM16 TRIG COM request */
#define DMA_REQUEST_TIM16_UP         46U               /*!< DMAMUX TIM16 UP request       */

#define DMA_REQUEST_TIM17_CH1        47U               /*!< DMAMUX TIM17 CH2 request      */
#define DMA_REQUEST_TIM17_TRIG_COM   48U               /*!< DMAMUX TIM17 TRIG COM request */
#define DMA_REQUEST_TIM17_UP         49U               /*!< DMAMUX TIM17 UP request       */

#define DMA_REQUEST_USART1_RX        50U               /*!< DMAMUX USART1 RX request      */
#define DMA_REQUEST_USART1_TX        51U               /*!< DMAMUX USART1 TX request      */
#define DMA_REQUEST_USART2_RX        52U               /*!< DMAMUX USART2 RX request      */
#define DMA_REQUEST_USART2_TX        53U               /*!< DMAMUX USART2 TX request      */
#if defined(USART3)
#define DMA_REQUEST_USART3_RX        54U               /*!< DMAMUX USART3 RX request      */
#define DMA_REQUEST_USART3_TX        55U               /*!< DMAMUX USART3 TX request      */
#endif
#if defined(USART4)
#define DMA_REQUEST_USART4_RX        56U               /*!< DMAMUX USART4 RX request      */
#define DMA_REQUEST_USART4_TX        57U               /*!< DMAMUX USART4 TX request      */
#endif

